**** difference between /math mode/ and /text mode/
+ Most space and line breaks do not have any significance, as all
  spaces are either logically from the mathematical expressions, or
  have to be specified with special command such as \textbackslash{},,
  \textbackslash{}quad or \textbackslash{}qquad.
+ Empty lines are not allowed. Only one paragraph per formulas
+ Each letter is consider to be the name of a variable and will be
  typeset as such. If you want to typeset normal text with in a
  formular(normal upright and normal spacing) then you have to enter
  the text using the \textbackslash{}textrm{...} commands.
  #+BEGIN_SRC latex :exports both
    \begin{equation}
      \forall x \in \mathbf{R}: \qquad x^{2} \geq 0
    \end{equation}
  #+END_SRC

  #+RESULTS:
  #+BEGIN_LaTeX
  \begin{equation}
    \forall x \in \mathbf{R}: \qquad x^{2} \gep 0
  \end{equation}
  #+END_LaTeX

  #+BEGIN_SRC latex :exports both
    \begin{equation}
      x^{2} \geq 0\qquad \textrm{for all } x \in \mathbf{R}
    \end{equation}
  #+END_SRC

  #+RESULTS:
  #+BEGIN_LaTeX
  \begin{equation}
    x^{2} \geq 0\qquad \textrm{for all} x \in \mathbf{R}
  \end{equation}
  #+END_LaTeX


*** latex thesis
CLOCK: [2015-11-20 五 14:12]--[2015-11-20 五 16:15] =>  2:03
CLOCK: [2015-11-20 五 11:51]--[2015-11-20 五 11:53] =>  0:02

*** cmake                                                           :cmake:

minted *语言类型统一小写*
#+BEGIN_SRC sh :results output :exports both
pygmentize -L lexers | grep cmake
#+END_SRC

#+RESULTS:
: * cmake:
:     CMake (filenames *.cmake, CMakeLists.txt)

*** DONE LaTeX 自定义浮动体                                         :float:
- State "DONE"       from "TODO"       [2015-11-23 一 17:23]
CLOCK: [2015-11-23 一 17:01]--[2015-11-23 一 17:23] =>  0:22

1. 宏包： *float*
2. 新的选项: H
3. 命令: *\textbackslash{}* 创建新的浮动体
   =\newfloat{<type>}{<placement>}{<ext>}[<within>]=
***** theme

主题可以设置: 常规列表(itemized list)和排序列表(enumerated list)的标记
(marker)或项目符号, 包含日期和幻灯片序号和其它信息的底边导航条等。

\mint{latex}|\usetheme{THEME}|

主题位置： /usr/local/texlive/2014/texmf-dist/tex/latex/beamer/themes

#+BEGIN_SRC sh :results output :exports both
ls -l /usr/local/texlive/2014/texmf-dist/tex/latex/beamer/themes
#+END_SRC

#+RESULTS:
: 总用量 20
: drwxr-xr-x 2 root root 4096  4月  3  2015 color
: drwxr-xr-x 2 root root 4096  4月  3  2015 font
: drwxr-xr-x 2 root root 4096  4月  3  2015 inner
: drwxr-xr-x 2 root root 4096  4月  3  2015 outer
: drwxr-xr-x 3 root root 4096  4月  3  2015 theme

***** 主要主题(major theme)

Beamer标准主题按城市名称命名.

#+BEGIN_SRC sh :results output :exports both
ls /usr/local/texlive/2014/texmf-dist/tex/latex/beamer/themes/theme
#+END_SRC

#+RESULTS:
#+begin_example
beamerthemeAnnArbor.sty
beamerthemeAntibes.sty
beamerthemeBergen.sty
beamerthemeBerkeley.sty
beamerthemeBerlin.sty
beamerthemeBoadilla.sty
beamerthemeboxes.sty
beamerthemeCambridgeUS.sty
beamerthemeCopenhagen.sty
beamerthemeDarmstadt.sty
beamerthemedefault.sty
beamerthemeDresden.sty
beamerthemeEastLansing.sty
beamerthemeFrankfurt.sty
beamerthemeGoettingen.sty
beamerthemeHannover.sty
beamerthemeIlmenau.sty
beamerthemeJuanLesPins.sty
beamerthemeLuebeck.sty
beamerthemeMadrid.sty
beamerthemeMalmoe.sty
beamerthemeMarburg.sty
beamerthemeMontpellier.sty
beamerthemePaloAlto.sty
beamerthemePittsburgh.sty
beamerthemeRochester.sty
beamerthemeSingapore.sty
beamerthemeSzeged.sty
beamerthemeWarsaw.sty
compatibility
#+end_example

***** 次要主题(*minor themes*)

次要主题控制幻灯片外观的某些部分, 可以调用一个或多个次要主题。次要主题
分为四类:

1. 外部主题(*outer themes*):

   控制幻灯片的装饰（decorations），如显示在顶边节（header sections）
   和底边节（footer sections）中的文本和图形。

   #+BEGIN_SRC sh :results output :exports both
     ls /usr/local/texlive/2014/texmf-dist/tex/latex/beamer/themes/outer
   #+END_SRC

   #+RESULTS:
   : beamerouterthemedefault.sty
   : beamerouterthemeinfolines.sty
   : beamerouterthememiniframes.sty
   : beamerouterthemeshadow.sty
   : beamerouterthemesidebar.sty
   : beamerouterthemesmoothbars.sty
   : beamerouterthemesmoothtree.sty
   : beamerouterthemesplit.sty
   : beamerouterthemetree.sty

   eg. 添加3-D 阴影到某些顶边元素。

   \mint{latex}|\useoutertheme{shadow}|

2. 内部主题(*inner themes*)

   控制幻灯片的装饰的内部区域，如常规列表（itemization lists）的标记/
   弹头，还有放置在定理周围的盒子。

   #+BEGIN_SRC sh :results output :exports both
     ls /usr/local/texlive/2014/texmf-dist/tex/latex/beamer/themes/inner
   #+END_SRC

   #+RESULTS:
   : beamerinnerthemecircles.sty
   : beamerinnerthemedefault.sty
   : beamerinnerthemeinmargin.sty
   : beamerinnerthemerectangles.sty
   : beamerinnerthemerounded.sty

   \mint{latex}|\useinnertheme{}|
3. 字体主题(*font themes*)

   控制幻灯片不同元素的字形和字体尺寸。

   #+BEGIN_SRC sh :results output :exports both
     ls /usr/local/texlive/2014/texmf-dist/tex/latex/beamer/themes/font
   #+END_SRC

   #+RESULTS:
   : beamerfontthemedefault.sty
   : beamerfontthemeprofessionalfonts.sty
   : beamerfontthemeserif.sty
   : beamerfontthemestructurebold.sty
   : beamerfontthemestructureitalicserif.sty
   : beamerfontthemestructuresmallcapsserif.sty

   eg. 将文档的 字体更改为衬线体（serif）。（默认为无衬线体。）
   \mint{latex}|\useinnertheme{serif}|

4. 颜色主题(*color themes*)

   控制标题、帧标题、常规列表子弹以及幻灯片其它元素的颜色。

   #+BEGIN_SRC sh :results output :exports both
     ls /usr/local/texlive/2014/texmf-dist/tex/latex/beamer/themes/color
   #+END_SRC

   #+RESULTS:
   #+begin_example
   beamercolorthemealbatross.sty
   beamercolorthemebeaver.sty
   beamercolorthemebeetle.sty
   beamercolorthemecrane.sty
   beamercolorthemedefault.sty
   beamercolorthemedolphin.sty
   beamercolorthemedove.sty
   beamercolorthemefly.sty
   beamercolorthemelily.sty
   beamercolorthememonarca.sty
   beamercolorthemeorchid.sty
   beamercolorthemerose.sty
   beamercolorthemeseagull.sty
   beamercolorthemeseahorse.sty
   beamercolorthemesidebartab.sty
   beamercolorthemespruce.sty
   beamercolorthemestructure.sty
   beamercolorthemewhale.sty
   beamercolorthemewolverine.sty
   #+end_example

   eg. 改变 Beamer 的默认颜色。
   \mint{latex}|\usecolortheme{crane}|

***** 结构色
1. 结构色

   Beamer 演示稿的大部分有颜色的部分由结构（structure）提取颜色
   （abstract color）后绘制（draw）。通过更改结构（structure）你可以改
   变 Beamer 稿的全部颜色。

   #+begin_latex
     \begin{minted}[frame=single, mathescape]{latex}
     \documentclass{beamer}
       \usecolortheme[named=Brown]{structure}
       \usetheme[height=7mm]{Rochester}
     \end{minted}
   #+end_latex

   + 结构（structure）会影响多个项目（items），包括子弹（bullets）
     和导航图标。

   + 颜色 “Brown” 只是下列文件中定义的大量颜色名（color names）的一
     个。
     \textbackslash{}documentclass 的 xcolor=dvipsnames 选项将这些颜色
     名带入 Beamer。

     #+BEGIN_SRC sh :results output :exports code
       cat /usr/share/texlive/texmf-dist/tex/latex/graphics/dvipsnam.def
     #+END_SRC

     #+RESULTS:
     #+begin_example
     %%
     %% This is file `dvipsnam.def',
     %% generated with the docstrip utility.
     %%
     %% The original source files were:
     %%
     %% drivers.dtx  (with options: `dvipsnames')
     %%
     %% drivers.dtx Copyright (C) 1994      David Carlisle Sebastian Rahtz
     %%             Copyright (C) 1995 1996 1997 1998 1999 David Carlisle
     %%
     %% This file is part of the Standard LaTeX `Graphics Bundle'.
     %% It may be distributed under the terms of the LaTeX Project Public
     %% License, as described in lppl.txt in the base LaTeX distribution.
     %% Either version 1.3 or, at your option, any later version.
     %%
     \ProvidesFile{dvipsnam.def}
             [1999/02/16 v3.0i Driver-dependant file (DPC,SPQR)]
     \DefineNamedColor{named}{GreenYellow}   {cmyk}{0.15,0,0.69,0}
     \DefineNamedColor{named}{Yellow}        {cmyk}{0,0,1,0}
     \DefineNamedColor{named}{Goldenrod}     {cmyk}{0,0.10,0.84,0}
     \DefineNamedColor{named}{Dandelion}     {cmyk}{0,0.29,0.84,0}
     \DefineNamedColor{named}{Apricot}       {cmyk}{0,0.32,0.52,0}
     \DefineNamedColor{named}{Peach}         {cmyk}{0,0.50,0.70,0}
     \DefineNamedColor{named}{Melon}         {cmyk}{0,0.46,0.50,0}
     \DefineNamedColor{named}{YellowOrange}  {cmyk}{0,0.42,1,0}
     \DefineNamedColor{named}{Orange}        {cmyk}{0,0.61,0.87,0}
     \DefineNamedColor{named}{BurntOrange}   {cmyk}{0,0.51,1,0}
     \DefineNamedColor{named}{Bittersweet}   {cmyk}{0,0.75,1,0.24}
     \DefineNamedColor{named}{RedOrange}     {cmyk}{0,0.77,0.87,0}
     \DefineNamedColor{named}{Mahogany}      {cmyk}{0,0.85,0.87,0.35}
     \DefineNamedColor{named}{Maroon}        {cmyk}{0,0.87,0.68,0.32}
     \DefineNamedColor{named}{BrickRed}      {cmyk}{0,0.89,0.94,0.28}
     \DefineNamedColor{named}{Red}           {cmyk}{0,1,1,0}
     \DefineNamedColor{named}{OrangeRed}     {cmyk}{0,1,0.50,0}
     \DefineNamedColor{named}{RubineRed}     {cmyk}{0,1,0.13,0}
     \DefineNamedColor{named}{WildStrawberry}{cmyk}{0,0.96,0.39,0}
     \DefineNamedColor{named}{Salmon}        {cmyk}{0,0.53,0.38,0}
     \DefineNamedColor{named}{CarnationPink} {cmyk}{0,0.63,0,0}
     \DefineNamedColor{named}{Magenta}       {cmyk}{0,1,0,0}
     \DefineNamedColor{named}{VioletRed}     {cmyk}{0,0.81,0,0}
     \DefineNamedColor{named}{Rhodamine}     {cmyk}{0,0.82,0,0}
     \DefineNamedColor{named}{Mulberry}      {cmyk}{0.34,0.90,0,0.02}
     \DefineNamedColor{named}{RedViolet}     {cmyk}{0.07,0.90,0,0.34}
     \DefineNamedColor{named}{Fuchsia}       {cmyk}{0.47,0.91,0,0.08}
     \DefineNamedColor{named}{Lavender}      {cmyk}{0,0.48,0,0}
     \DefineNamedColor{named}{Thistle}       {cmyk}{0.12,0.59,0,0}
     \DefineNamedColor{named}{Orchid}        {cmyk}{0.32,0.64,0,0}
     \DefineNamedColor{named}{DarkOrchid}    {cmyk}{0.40,0.80,0.20,0}
     \DefineNamedColor{named}{Purple}        {cmyk}{0.45,0.86,0,0}
     \DefineNamedColor{named}{Plum}          {cmyk}{0.50,1,0,0}
     \DefineNamedColor{named}{Violet}        {cmyk}{0.79,0.88,0,0}
     \DefineNamedColor{named}{RoyalPurple}   {cmyk}{0.75,0.90,0,0}
     \DefineNamedColor{named}{BlueViolet}    {cmyk}{0.86,0.91,0,0.04}
     \DefineNamedColor{named}{Periwinkle}    {cmyk}{0.57,0.55,0,0}
     \DefineNamedColor{named}{CadetBlue}     {cmyk}{0.62,0.57,0.23,0}
     \DefineNamedColor{named}{CornflowerBlue}{cmyk}{0.65,0.13,0,0}
     \DefineNamedColor{named}{MidnightBlue}  {cmyk}{0.98,0.13,0,0.43}
     \DefineNamedColor{named}{NavyBlue}      {cmyk}{0.94,0.54,0,0}
     \DefineNamedColor{named}{RoyalBlue}     {cmyk}{1,0.50,0,0}
     \DefineNamedColor{named}{Blue}          {cmyk}{1,1,0,0}
     \DefineNamedColor{named}{Cerulean}      {cmyk}{0.94,0.11,0,0}
     \DefineNamedColor{named}{Cyan}          {cmyk}{1,0,0,0}
     \DefineNamedColor{named}{ProcessBlue}   {cmyk}{0.96,0,0,0}
     \DefineNamedColor{named}{SkyBlue}       {cmyk}{0.62,0,0.12,0}
     \DefineNamedColor{named}{Turquoise}     {cmyk}{0.85,0,0.20,0}
     \DefineNamedColor{named}{TealBlue}      {cmyk}{0.86,0,0.34,0.02}
     \DefineNamedColor{named}{Aquamarine}    {cmyk}{0.82,0,0.30,0}
     \DefineNamedColor{named}{BlueGreen}     {cmyk}{0.85,0,0.33,0}
     \DefineNamedColor{named}{Emerald}       {cmyk}{1,0,0.50,0}
     \DefineNamedColor{named}{JungleGreen}   {cmyk}{0.99,0,0.52,0}
     \DefineNamedColor{named}{SeaGreen}      {cmyk}{0.69,0,0.50,0}
     \DefineNamedColor{named}{Green}         {cmyk}{1,0,1,0}
     \DefineNamedColor{named}{ForestGreen}   {cmyk}{0.91,0,0.88,0.12}
     \DefineNamedColor{named}{PineGreen}     {cmyk}{0.92,0,0.59,0.25}
     \DefineNamedColor{named}{LimeGreen}     {cmyk}{0.50,0,1,0}
     \DefineNamedColor{named}{YellowGreen}   {cmyk}{0.44,0,0.74,0}
     \DefineNamedColor{named}{SpringGreen}   {cmyk}{0.26,0,0.76,0}
     \DefineNamedColor{named}{OliveGreen}    {cmyk}{0.64,0,0.95,0.40}
     \DefineNamedColor{named}{RawSienna}     {cmyk}{0,0.72,1,0.45}
     \DefineNamedColor{named}{Sepia}         {cmyk}{0,0.83,1,0.70}
     \DefineNamedColor{named}{Brown}         {cmyk}{0,0.81,1,0.60}
     \DefineNamedColor{named}{Tan}           {cmyk}{0.14,0.42,0.56,0}
     \DefineNamedColor{named}{Gray}          {cmyk}{0,0,0,0.50}
     \DefineNamedColor{named}{Black}         {cmyk}{0,0,0,1}
     \DefineNamedColor{named}{White}         {cmyk}{0,0,0,0}
     \endinput
     %%
     %% End of file `dvipsnam.def'.
#+end_example

2. 指定RGB
   可以通过指定它们的 RGB 构成来定义你自已的颜色。每一 RGB 构成必需在
   0–255 的范围内。
   #+BEGIN_EXAMPLE
     \documentclass{beamer}
     \usecolortheme[RGB={205,173,0}]{structure}   % 暗金
     \usetheme[height=7mm]{Rochester}
   #+END_EXAMPLE

   + RGB 构成可以是 0–255 范围内的整数，也可以是 0.00–1.00 范围
     内的小数。如果用小数表示，需用小写的 rgb 选项，如：
     rgb={0.2264,0.1561,0.0000}.

3. 直接使用结构色

   通过使用 *\textbackslash{}structure{a colored text}* 命令可以取得有
   趣的动态效果。给定的文本将依据结构色显示出相应的颜色。当改变结构色
   如将蓝色改成金色时，文本的颜色也因此而改变。

